package algorithmbasic.basicsets.class33;

public class IndexTree2D {
    // 二维indexTree
    // 注意必须从1下标开始，才匹配后面的规律
    //  1  2  3  4  5  6  7  8  9  10  11
    //1 *  *  *  *  *  *  *  *  *   *  *
    //2 *  *  *  *  *  *  *  *  *   *  *
    //3 *  *  *  *  *  *  *  *  *   *  *
    //4 *  *  *  *  *  *  *  *  *   *  *
    //5 *  *  *  *  *  *  *  *  *   *  *
    //6 *  *  *  *  *  *  *  *  *   *  *
    //7 *  *  *  *  *  *  *  *  *   *  *
    //8 *  *  *  *  *  *  *  *  *   *  *
    //9 *  *  *  *  *  *  *  *  *   *  *
    //10*  *  *  *  *  *  *  *  *   *  *
    //11*  *  *  *  *  *  *  *  *   *  *

    //计算区间的累加和
    //更新某点的值


}
